<template>
	<div class="about-box">
		<scoreheader :title="title"></scoreheader>
		<div class="about-tip">
			<div class="title" style="margin-top: 0;">智慧产业共享经济云平台消费会员注册协议</div>
			<div class="cont" v-html="content"></div>
			<!-- <p class="le2">
				本协议是您与智慧产业共享经济云平台之间就网站服务等相关事宜所订立的契约，请您仔细阅读本注册协议，您勾选“本人同意”选项或点击“同意协议”按钮后，本协议即构成对双方有约束力的法律文件。
			</p>
			<p class="le2">
				请您务必审慎阅读、充分理解协议中相关条款内容，如您对协议有任何疑问，可向平台客服咨询。当您按照注册页面提示填写信息、阅读并同意协议且完成全部注册程序后，即表示您已充分阅读、理解并接受协议的全部内容。如您因平台服务而发生争议的，适用《CGC平台注册协议》处理。阅读协议的过程中，如果您不同意以下协议或其中任何条款约定，您应立即停止注册程序。
			</p>
			<div class="twoTitle">第1条 云平台服务条款的确认和接纳</div>
			<p class="le2">1.1 云平台的各项电子服务的所有权和运作权归广东成高成数据集成有限公司（以下简称“成高成”）所有。用户同意所有注册协议条款并完成注册程序，才能成为云平台的正式用户。用户确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。</p>
			<p class="le2">1.2 用户点击同意本协议的，即视为用户确认自己具有享受云平台服务、消费记录查询、中奖查询等相应的权利能力和行为能力，能够独立承担法律责任。</p>
			<p class="le2">1.3 如果您在18周岁以下，您只能在父母或监护人的监护参与下才能使用云平台。</p>
			<p class="le2">1.4 成高成保留在中华人民共和国施行之法律法规或行业规章允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消用户的权利。</p>
			
			<div class="twoTitle">第2条 云平台服务</div>
			<p class="le2">2.1 成高成通过互联网依法为用户提供互联网信息等服务，用户在完全同意本协议及云平台规定的情况下，方有权使用云平台的相关服务。</p>
			<p class="le2">2.2 用户必须自行准备如下设备和承担如下开支：</p>
			<p class="le2">（1）上网设备，包括并不限于电脑或者其他上网终端、调制解调器及其他必备的上网装置；</p>
			<p class="le2">（2）上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。</p>
			
			<div class="twoTitle">第3条 用户信息</div>
			<div>
				<P class="le2">3.1 用户应自行诚信向成高成及云平台提供注册资料，用户同意其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的；或者没有能够及时更新其注册资料的，用户需承担因此引起的相应责任及后果，并且成高成或云平台将保留终止此用户使用各项服务的权利。</p>
				<p class="le2">3.2 保护用户隐私是成高成的一项基本政策，成高成及云平台保证不对外公开或向第三方提供单个用户的注册资料及用户在使用网络服务时存储的非公开内容，但下列情况除外：</p>
				<p class="le2">1）事先获得用户的明确授权；</p>
				<p class="le2">2）根据有关的法律法规要求；</p>
				<p class="le2">3）按照相关政府主管部门的要求；</p>
				<p class="le2">4）为维护社会公众的利益；</p>
				<p class="le2">5）为维护成高成或云平台的合法权益。</p>
			
				<p class="le2">3.3 用户注册成功后，将产生用户名和密码等账户信息，您可以根据云平台规定改变您的密码。用户应谨慎合理的保存、使用其用户名和密码。用户若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通知云平台并向公安机关报案。</p>
				<p class="le2">3.4 用户同意，成高成及云平台拥有通过网站、邮件、微信、短信、电话等形式，向在云平台注册、用户、会员发送商品促销或其他相关商业信息、促销活动等告知信息的权利。</p>
				<p class="le2">3.5 用户不得将在云平台注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。因黑客行为或用户的保管疏忽导致帐号、密码遭他人非法使用，成高成不承担任何责任。</p>
				<p class="le2">3.6 用户同意，成高成及云平台有权在必要紧急、且为保护社会公共利益的情况使用用户的注册信息、用户名、密码等信息，登陆进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。</p>
				<p class="le2">3.7成高成或云平台与第三方合作向用户提供相关的网络服务的，在此情况下，如该第三方同意承担与成高成同等的保护用户隐私的责任，则成高成有权将用户的注册资料等提供给该第三方。</p>
				<p class="le2">3.8 用户同意，如用户获得成高成或云平台的相关奖励或参加成高成或云平台举办的相关活动，用户有义务在成高成或云平台的要求下提供用户相关信息及肖像权使用许可，包括但不限于真实姓名、手机号码、身份证号码、家庭住址、个人照片及活动所需的相关信息等资料。如用户没有按照成高成或云平台的要求提供相应的资料，成高成或云平台保留不予发放该用户的奖励和取消该用户参加活动的资格的权利。</p>
				<p class="le2">3.9 在不透露单个用户隐私资料的前提下，成高成或云平台有权对包括单个个体在内的整个用户数据库资料进行分析并对数据库进行商业上的利用。</p>
				
			
				<div class="twoTitle">第4条 用户依法言行义务</div>
			
				<p class="le2">本协议依据国家相关法律法规规章制定，用户同意严格遵守以下义务：</p>
				<p class="le2">（1）不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；</p>
				<p class="le2">（2）从中国大陆向境外传输资料信息时必须符合中国有关法规；</p>
				<p class="le2">（3）不得利用云平台从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；</p>
				<p class="le2">（4）不得干扰云平台的正常运转，不得侵入云平台及国家计算机信息系统；</p>
				<p class="le2">（5）不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的等信息资料；</p>
				<p class="le2">（6）不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；</p>
				<p class="le2">（7）不得教唆他人从事本条所禁止的行为；</p>
				<p class="le2">（8）不得利用在云平台注册的账户进行牟利性经营活动；</p>
				<p class="le2">（9）不得发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容；</p>
			
				<p class="le2">用户应不时关注并遵守云平台不时公布或修改的各类合法规则规定。</p>
				<p class="le2">成高成或云平台保有删除站内各类不符合法律政策或不真实的信息内容而无须通知用户的权利。</p>
				<p class="le2">成高成或云平台有权对用户使用成高成或云平台网络服务的情况进行审查和监督（包括但不限于对用户存储在成高成或云平台的内容进行审核），如用户在使用网络服务时违反任何上述规定，成高成或云平台或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户张贴的内容等、暂停或终止用户使用网络服务的权利）以减轻用户不当行为造成的影响。</p>
				<p class="le2">若用户未遵守以上规定的，成高成或云平台有权作出独立判断并采取暂停或关闭用户帐号等措施。用户须对自己在网上的言论和行为承担法律责任。</p>
				
			
			
				<div class="twoTitle">第5条 商品促销信息</div>
				<p class="le2">云平台上的商品价格、数量、是否有货等商品促销信息随时都有可能发生变动，云平台不作特别通知。由于网站上商品信息的数量极其庞大，虽然云平台会尽最大努力保证您所浏览商品信息的准确性，但由于众所周知的互联网技术因素等客观原因存在，云平台网页显示的信息可能会有一定的滞后性或差错，对此情形您知悉并理解；成高成或云平台欢迎纠错，并会视情况给予纠错者一定的奖励。</p>
			
			
				<div class="twoTitle">第6条 信息查询</div>
				<p class="le2">6.1 在您信息查询时，请您仔细确认所对应的用户名、手机号、密码等信息。手机号与用户本人不一致的，用户的行为和意思表示视为手机号的行为和意思表示，用户应对手机号的行为及意思表示的法律后果承担连带责任。</p>
				<p class="le2">6.2 除法律另有强制性规定外，双方约定如下：云平台上展示的商品、价格、促销活动等信息仅仅是要约邀请，您浏览时须填写您希望购买的商品数量、价款及支付方式、收货人、联系方式、收货地址（合同履行地点）、合同履行方式等内容；系统生成的订单信息是计算机信息系统根据您填写的内容自动生成的数据，仅是您向销售方发出的合同要约；销售方收到您的订单信息后，只有在销售方将您在订单中订购的商品从仓库实际直接向您发出时，方视为您与销售方之间就实际直接向您发出的商品建立了合同关系；如果您在一份订单里订购了多种商品并且销售方只给您发出了部分商品时，您与销售方之间仅就实际直接向您发出的商品建立了合同关系；只有在销售方实际直接向您发出了订单中订购的其他商品时，您和销售方之间就订单中该其他已实际直接向您发出的商品才成立合同关系。您可以随时登陆您在云平台注册的账户，查询您的订单状态。</p>
				<p class="le2">6.3 由于市场变化及各种以合理商业努力难以控制的因素的影响，云平台无法保证您提交的订单信息中希望购买的商品都会有货；如您拟购买的商品，发生缺货，您有权取消订单。</p>
				
				<div class="twoTitle">第7条 配送</div>
				<p class="le2">7.1 销售方将会把商品（货物）送到您所指定的收货地址，所有在云平台上列出的送货时间为参考时间，参考时间的计算是根据库存状况、正常的处理过程和送货时间、送货地点的基础上估计得出的。</p>
				<p class="le2">7.2 因如下情况造成订单延迟或无法配送等，销售方不承担延迟配送的责任：</p>
				<p class="le2">（1）用户提供的信息错误、地址不详细等原因导致的；</p>
				<p class="le2">（2）货物送达后无人签收，导致无法配送或延迟配送的；</p>
				<p class="le2">（3）情势变更因素导致的；</p>
				<p class="le2">（4）不可抗力因素导致的，例如：自然灾害、交通戒严、突发战争等。</p>
			
				<div class="twoTitle">第8条 所有权及知识产权条款</div>
				<p class="le2">8.1 用户一旦接受本协议，即表明该用户主动将其在任何时间段在云平台发表的任何形式的信息内容（包括但不限于客户评价、客户咨询、各类话题文章等信息内容）的财产性权利等任何可转让的权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销地转让给成高成或平台所有，用户同意成高成有权就任何主体侵权而单独提起诉讼。</p>
				<p class="le2">8.2 本协议已经构成《中华人民共和国著作权法》第二十五条（条文序号依照2011年版著作权法确定）及相关法律规定的著作财产权等权利转让书面协议，其效力及于用户在网站上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。</p>
				<p class="le2">8.3 用户同意并已充分了解本协议的条款，承诺不将已发表于云平台的信息，以任何形式发布或授权其它主体以任何方式使用（包括但限于在各类网站、媒体上使用）。</p>
				<p class="le2">8.4 成高成是云平台的制作者,拥有此网站内容及资源的著作权等合法权利,受国家法律保护,有权不时地对本协议及云平台的内容进行修改，并在云平台张贴，无须另行通知用户。在法律允许的最大限度范围内，成高成对本协议及云平台内容拥有解释权。</p>
				<p class="le2">8.5 除法律另有强制性规定外，未经成高成或云平台明确的特别书面许可,任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用云平台的信息内容，否则，成高成有权追究其法律责任。</p>
				<p class="le2">8.6 云平台所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件），均是成高成或其内容提供者的财产，受中国和国际版权法的保护。云平台上所有内容的汇编是成高成的排他财产，受中国和国际版权法的保护。云平台上所有软件都是成高成或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。</p>
			
			
				<div class="twoTitle">第9条 责任限制及不承诺担保</div>
				<p class="le2">除非另有明确的书面说明,云平台及其所包含的或以其它方式通过云平台提供给您的全部信息、内容、材料、产品（包括软件）和服务，均是在“按现状”和“按现有”的基础上提供的。</p>
				<p class="le2">除非另有明确的书面说明,成高成不对云平台的运营及其包含在本网站上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。</p>
				<p class="le2">用户明确同意其使用成高成或云平台服务所存在的风险将完全由其自己承担；因其使用云平台服务而产生的一切后果也由其自己承担，成高成对用户不承担任何责任。</p>
				<p class="le2">成高成不担保云平台所包含的或以其它方式通过云平台提供给您的全部信息、内容、材料、产品（包括软件）和服务、其服务器或从云平台发出的电子信件、信息没有病毒或其他有害成分。</p>
				<p class="le2">成高成或云平台不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。</p>
				<p class="le2">成高成或云平台不保证为向用户提供便利而设置的外部链接的准确性和完整性，同时，对于该等外部链接指向的不由云平台实际控制的任何网页上的内容，成高成或云平台不承担任何责任。</p>
				<p class="le2">如因不可抗力或其它云平台无法控制的原因使云平台销售系统崩溃或无法正常使用导致网上交易无法完成或丢失有关的信息、记录等，成高成或云平台不承担任何责任，成高成或云平台会合理地尽力协助处理善后事宜，尽力减少因此而给用户造成的损失和影响。</p>
			
			
				<div class="twoTitle">第10条 协议更新及用户关注义务</div>
				<p class="le2">根据国家法律法规变化及网站运营需要，成高成或云平台有权对本协议条款不时地进行修改，修改后的协议一旦被张贴在云平台上即生效，并代替原来的协议。用户可随时登陆查阅最新协议；用户有义务不时关注并阅读最新版的协议及网站公告。如用户不同意更新后的协议，可以且应立即停止接受网站依据本协议提供的服务；如用户继续使用本网站提供的服务的，即视为同意更新后的协议。成高成建议您在使用云平台之前阅读本协议及云平台的公告。如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。</p>
			
			
				<div class="twoTitle">第11条 法律管辖和适用</div>
				<p class="le2">本协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区适用之有效法律（但不包括其冲突法规则）。如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。如缔约方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向有管辖权的中华人民共和国大陆地区法院提起诉讼。</p>
				<p class="le2">如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。</p>
			
			
				<div class="twoTitle">第12条 其他</div>
				<p class="le2">12.1 成高成网站所有者是指在政府部门依法许可或备案的网站经营主体。</p>
				<p class="le2">12.2 您勾选本协议上方的“本人同意”选项即视为您完全接受本协议，在点击之前请您再次确认已知悉并完全理解本协议的全部内容。</p>
				<p class="le2">12.3 成高成或云平台尊重用户和消费者的合法权利，本协议及本网站上发布的各类规则、声明等其他内容，均是为了更好的、更加便利的为用户和消费者提供服务。云平台欢迎用户和社会各界提出意见和建议，成高成将虚心接受并适时修改本协议及云平台上的各类规则。	</p>
			
			-->
			</div> 
		</div>
	</div>
</template>

<script>
	import scoreheader from '../../../components/setting_header'
	export default {
		components: {
			scoreheader
		},
		data() {
			return {
				title: 'CGC平台注册协议',
				content:''
			}
		},
		beforeRouteLeave(to, from, next) {
			if(to.path == '/user/reg') {
				to.meta.keepAlive = true
			} else {
				to.meta.keepAlive = false
			}
			next()
		},
		mounted(){
			this.onLoad()
		},
		methods: {
			onLoad(){
				var _this = this
				_this.$http.get(_this.url.user.getInfoByType,{
					params:{
						type:1
					}
				}).then((res) => {
					if(res.data.status == "00000000"){
						// console.log(res.data.data)
						_this.content = res.data.data.content
					}
				})
			}
		}
	}
</script>

<style lang="less" scoped>
	.about-box {
		height: 100%;
		background: white;
		.about-tip {
			.le2 {
				text-indent: 0.4rem;
				margin: 0.2rem 0;
			}
			padding: 0.27rem;
			font-family: PingFangSC-Medium;
			position: relative;
			.title {
				font-size: 0.32rem;
				margin: 0.27rem 0;
				color: rgba(26, 38, 66, 1);
				text-align: center;
			}
			p {
				font-size: 0.28rem;
				color: rgba(26, 38, 66, 1);
			}
			.twoTitle {
				font-size: 0.28rem;
				color: rgba(51, 111, 255, 1);
				margin: 0.15rem 0;
			}
		}
		.about-tip:before {
			content: " ";
			position: absolute;
			left: 0;
			top: 0;
			right: 0;
			height: 1px;
			border-top: 1px solid #D9D9D9;
			color: #D9D9D9;
			-webkit-transform-origin: 0 0;
			transform-origin: 0 0;
			-webkit-transform: scaleY(0.5);
			transform: scaleY(0.5);
			left: 0px;
		}
	}
</style>